<a href="https://colab.research.google.com/github/Assurance-Project-secure-road/analyse/blob/main/Assurance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [ ]:
caracteristiques = pd.read_csv("https://raw.githubusercontent.com/Assurance-Project-secure-road/analyse/main/caracteristiques-2019.csv", delimiter=";")
caracteristiques

            Num_Acc  jour  mois  ...                    adr         lat       long
0      201900000001    30    11  ...           AUTOROUTE A3  48,8962100  2,4701200
1      201900000002    30    11  ...           AUTOROUTE A1  48,9307000  2,3688000
2      201900000003    28    11  ...          AUTOROUTE A86  48,9358718  2,3191744
3      201900000004    30    11  ...                     A4  48,8173295  2,4281502
4      201900000005    30    11  ...                A86 INT  48,7763620  2,4332540
...             ...   ...   ...  ...                    ...         ...        ...
58835  201900058836    30    11  ...  A43   13.029 A 15.971  45,6666600  5,0561200
58836  201900058837    27    11  ...         Autoroute A.35  48,5769000  7,7269000
58837  201900058838    30    11  ...          AUTOROUTE A6A  48,7717000  2,3457600
58838  201900058839    30    11  ...                A86 EXT  48,7772890  2,2237590
58839  201900058840    29    11  ...                    A13  48,8351236  2,1751101

[58840 rows x 15 columns]

In [ ]:
carac

In [ ]:
vehicules = pd.read_csv("https://raw.githubusercontent.com/Assurance-Project-secure-road/analyse/main/vehicules-2019.csv", delimiter=";")
vehicules

             Num_Acc  id_vehicule num_veh  senc  ...  choc  manv  motor  occutc
0       201900000001  138 306 524     B01     2  ...     5    23      1     NaN
1       201900000001  138 306 525     A01     2  ...     3    11      1     NaN
2       201900000002  138 306 523     A01     1  ...     1     0      1     NaN
3       201900000003  138 306 520     A01     1  ...     1     2      1     NaN
4       201900000003  138 306 521     B01     1  ...     4     2      1     NaN
...              ...          ...     ...   ...  ...   ...   ...    ...     ...
100705  201900058837  137 982 135     C01     1  ...     1     2      1     NaN
100706  201900058838  137 982 132     A01     2  ...     1    21      0     NaN
100707  201900058839  137 982 131     A01     2  ...     7     1      1     NaN
100708  201900058840  137 982 129     B01     1  ...     4     0      2     NaN
100709  201900058840  137 982 130     A01     1  ...     1     0      1     NaN

[100710 rows x 11 columns]

In [ ]:
vehicules.describe()

            Num_Acc           senc  ...          motor      occutc
count  1.007100e+05  100710.000000  ...  100710.000000  892.000000
mean   2.019000e+11       1.557075  ...       1.171353    1.818386
std    1.697432e+04       0.833885  ...       1.112887    2.858931
min    2.019000e+11      -1.000000  ...      -1.000000    0.000000
25%    2.019000e+11       1.000000  ...       1.000000    1.000000
50%    2.019000e+11       1.000000  ...       1.000000    1.000000
75%    2.019000e+11       2.000000  ...       1.000000    1.000000
max    2.019001e+11       3.000000  ...       6.000000   33.000000

[8 rows x 9 columns]

In [ ]:
vehicules.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100710 entries, 0 to 100709
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Num_Acc      100710 non-null  int64
 1   id_vehicule  100710 non-null  object
 2   num_veh      100710 non-null  object
 3   senc         100710 non-null  int64
 4   catv         100710 non-null  int64
 5   obs          100710 non-null  int64
 6   obsm         100710 non-null  int64
 7   choc         100710 non-null  int64
 8   manv         100710 non-null  int64
 9   motor        100710 non-null  int64
 10  occutc       892 non-null     float64
dtypes: float64(1), int64(8), object(2)
memory usage: 8.5+ MB

In [ ]:
vehicules["catv"].value_counts()
#60% nb d'accidents sont des véhicules légères (voitures)

7     60787
33     8205
10     6608
1      5000
2      3716
30     2990
32     2399
31     1898
34     1325
15      978
3       856
17      835
14      752
37      717
50      636
43      460
99      435
13      405
0       309
80      253
21      250
20      175
38      175
36      150
60      141
40      116
16       39
42       35
39       32
35       21
41       12
Name: catv, dtype: int64